In [2]:
import pandas as pd
import numpy as np

In [3]:
df_indo = pd.read_excel('EXGR_Indonesian names.xlsx')
df_indo.head()

,Unnamed: 0,fullname,Family name,Given name
0,http://www.wikidata.org/entity/Q7313790,Bertrand Antolin,NaN,NaN
1,http://www.wikidata.org/entity/Q15138877,Ray Rizal,NaN,NaN
2,http://www.wikidata.org/entity/Q17411237,Samsuridjal Djauzi,NaN,NaN
3,http://www.wikidata.org/entity/Q12497619,Max Arifin,NaN,NaN
4,http://www.wikidata.org/entity/Q7475963,Donita,NaN,NaN

In [4]:
df_malay = pd.read_excel('EXGR_Malay names.xlsx')
df_malay.head()

,Unnamed: 0,fullname,Family name,Given name
0,http://www.wikidata.org/entity/Q4769705,Annuar Rapaee,NaN,NaN
1,http://www.wikidata.org/entity/Q31186972,Tash Yong,NaN,NaN
2,http://www.wikidata.org/entity/Q468519,Fatmawati,NaN,NaN
3,http://www.wikidata.org/entity/Q4736793,Alto Linus,NaN,NaN
4,http://www.wikidata.org/entity/Q28837179,Mohamad Izzat Abdul Halil,NaN,NaN

In [5]:
print(np.any(df_indo['fullname'].isnull()))
print(np.any(df_malay['fullname'].isnull()))

False
False

In [15]:
#df_indo['Designation'].unique()

In [ ]:
#df_indo['Comment'].unique()

In [17]:
#df_indo.drop(columns = ['Unnamed: 0', 'Unnamed: 6', 'Unnamed: 7'], inplace = True)
df_indo.drop(columns = 'Unnamed: 0', inplace = True)
df_indo.head()

             fullname  Family name  Given name
0    Bertrand Antolin          NaN         NaN
1           Ray Rizal          NaN         NaN
2  Samsuridjal Djauzi          NaN         NaN
3          Max Arifin          NaN         NaN
4              Donita          NaN         NaN

In [20]:
df_malay.head()

,Unnamed: 0,fullname,Family name,Given name
0,http://www.wikidata.org/entity/Q4769705,Annuar Rapaee,NaN,NaN
1,http://www.wikidata.org/entity/Q31186972,Tash Yong,NaN,NaN
2,http://www.wikidata.org/entity/Q468519,Fatmawati,NaN,NaN
3,http://www.wikidata.org/entity/Q4736793,Alto Linus,NaN,NaN
4,http://www.wikidata.org/entity/Q28837179,Mohamad Izzat Abdul Halil,NaN,NaN

In [22]:
df_malay.drop(columns = 'Unnamed: 0', inplace = True)
df_malay.head()

                    fullname  Family name  Given name
0              Annuar Rapaee          NaN         NaN
1                  Tash Yong          NaN         NaN
2                  Fatmawati          NaN         NaN
3                 Alto Linus          NaN         NaN
4  Mohamad Izzat Abdul Halil          NaN         NaN

In [24]:
print(np.any(df_indo.duplicated()))
print(np.any(df_malay.duplicated()))

True
True

In [26]:
df_indo[df_indo.duplicated()]

                 fullname  Family name  Given name
154            Fauzi Bowo          NaN         NaN
173         Rini Yulianti          NaN         NaN
241        Leonardus Miau          NaN         NaN
290    Maraden Panggabean          NaN         NaN
393           Ryuji Utomo          NaN         NaN
...                   ...          ...         ...
21724    Shareefa Daanish          NaN         NaN
21726       Reony Mainaky          NaN         NaN
21727             Imaniar          NaN         NaN
21728       Maya Caroline          NaN         NaN
21729       Salman Aditya          NaN         NaN

[10403 rows x 3 columns]

In [28]:
print(len(df_indo[df_indo.duplicated()]))
print(len(df_malay[df_malay.duplicated()]))

10403
2016

In [36]:
df_indo.drop_duplicates(inplace = True, ignore_index = True)
df_malay.drop_duplicates(inplace = True, ignore_index = True)

print(np.any(df_indo.duplicated()))
print(np.any(df_malay.duplicated()))

False
False

In [38]:
# Comparing indonesian names 2 and indo names 1
df_indo2 = pd.read_excel('EXGR_Indonesian names-2.xlsx')
df_indo2.head()

,Unnamed: 0,fullname,Family name,Given name,Designation,Comment,Unnamed: 6,Unnamed: 7
0,http://www.wikidata.org/entity/Q7475963,Donita,NaN,Donita,NaN,It is common for Indonesians to have only 1 gi...,NaN,1
1,http://www.wikidata.org/entity/Q7645143,Supriyadi,NaN,Supriyadi,NaN,NaN,NaN,1
2,http://www.wikidata.org/entity/Q7844727,Triyaningsih,NaN,Triyaningsih,NaN,NaN,NaN,1
3,http://www.wikidata.org/entity/Q12515781,Soerjadi,NaN,Soerjadi,NaN,NaN,NaN,1
4,http://www.wikidata.org/entity/Q12523244,Undunsyah,NaN,Undunsyah,NaN,NaN,NaN,1

In [40]:
df_indo2.drop(columns = ['Unnamed: 0', 'Designation', 'Comment', 'Unnamed: 6', 'Unnamed: 7'], inplace = True)
df_indo2.head()

       fullname Family name    Given name
0        Donita         NaN        Donita
1     Supriyadi         NaN     Supriyadi
2  Triyaningsih         NaN  Triyaningsih
3      Soerjadi         NaN      Soerjadi
4     Undunsyah         NaN     Undunsyah

In [42]:
np.any(df_indo2['Given name'].isnull())

True

In [54]:
df_indo2[df_indo2['Given name'].isnull()]

,fullname,Family name,Given name
10364,RO Tambunan,NaN,NaN
10365,Setiawan Dalimartha,NaN,NaN
10366,Ismet Iskandar,NaN,NaN
10367,Oktovianus Maniani,NaN,NaN
10368,Cucu Hidayat,NaN,NaN
...,...,...,...
21722,Sultan Amaluddin Al Sani Perkasa Alamsyah,NaN,NaN
21723,Maria Genoveva Natalia Desy Purnamasari Gunawan,NaN,NaN
21724,Kanjeng Raden Tumengung Mas Ariya Purnama Hadi...,NaN,NaN
21725,Kanjeng Raden Tumengung Mas Ariya Purnama Hadi...,NaN,NaN
21726,Lord Kanjeng Baginda Atep Bin Lord Dari Segala...,NaN,NaN